# Simulation of the Potjans and Diesmann (2014) graph using the Galves and Locherbach (2013) classical neuron model in discrete time.
# By classical we describe the leak function (g_i(t)) as an exponentially decaying function. This is the only configuration where
# the GL neuron model can be described by a single Markovian system. For more complex leak functions, such as the alpha- or beta-function,
# a two state variable system is required to describe the model in a Markovian configuration.
# For the random nubmer generation, the xoroshiro128+ pseudo random namber generator will be used.
#
#  filename: dPD_GL_psc_delta_xoroshiro.org
#
#  Director:
#  Antonio Galves
#
#  Developers:
#  Nilton L. Kamiji
#  Jorge Stolfi
#  Renan Shimoura
#  Christophe Pouzat
#
#  Contributors:
#  Aline Duarte
#  Antonio Roque
#  Karine Guimaraes
#
#  March 08, 2021


# -*- ispell-local-dictionary: "american" -*-
#+OPTIONS: ':nil *:t -:t ::t <:t H:4 \n:nil ^:nil arch:headline
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:nil tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:t todo:t |:t
#+TITLE: Implementaion of the Potjans Diesmann microcircuit model using the classical Galves-L@@latex:\"{o}@@cherbach neuron model
#+AUTHOR: Nilton Liuji Kamiji, Christophe Pouzat, Aline Duarte, Antonio Roque, @@latex:\\@@Antonio Galves
#+EMAIL: nilton.kamiji@usp.br
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 27.2 (Org mode 9.4.4)
#+STARTUP: indent
#+LaTeX_CLASS: koma-article
#+LaTeX_CLASS_OPTIONS: [11pt]
#+LaTeX_HEADER: \renewenvironment{verbatim}{\begin{alltt} \scriptsize \color{Bittersweet} \vspace{0.2cm} }{\vspace{0.2cm} \end{alltt} v\normalsize \color{black}}
#+LaTeX_HEADER: \definecolor{lightcolor}{gray}{.55}
#+LaTeX_HEADER: \definecolor{shadecolor}{gray}{.95}
#+PROPERTY: header-args :eval no-export
#+PROPERTY: header-args:python :results pp
*** Binary sequences as unsigned integers
A spike train /realization/ is a sequence of 0 and 1 like: =00100101000010001=. It can also be viewed as a non-negative (unsigned) integer, assuming that $K$ time steps are considered, $\{x_{i}=0,x_{i+1}=0,x_{i+2}=1,\ldots,x_{i+K}=1\}$ can be mapped to the integer: $$S=x_{i} 2^{K-1}+x_{i+1} 2^{K-2} + \cdots + x_{i+K} 2^0\,.$$ A nice feature of integer representation in =Python= is that: [[https://docs.python.org/3/library/stdtypes.html\#typesnumeric][Integers have unlimited precision]]; stated differently integers are memory (RAM size) limited. This is a very specific feature of =Python=, most languages impose a limit (upper bound) to (unsigned) integers, typically $2^{32}-1$
 of $2^{64}-1$. A binary sequence like the one we just wrote, =00100101000010001=, can be directly converted into a integer with:

#+NAME: spike-train-sequence-reprentation-int
#+BEGIN_SRC python :exports both :session *Python*
int(0b00100101000010001)
#+END_SRC

#+RESULTS: spike-train-sequence-reprentation-int
: 18961


Notice the =0b= prefix, that's the way to declare a binary literal in =Python=, see the [[https://docs.python.org/3/library/functions.html?highlight=bin\#int][int]] function documentation. Function [[https://docs.python.org/3/library/functions.html?highlight=bin\#bin][bin]] allows us to go the other way around:

#+NAME: spike-train-sequence-reprentation-bin
#+BEGIN_SRC python :exports both :session *Python*
bin(18961)
#+END_SRC

#+RESULTS: spike-train-sequence-reprentation-bin
: 0b100101000010001


Notice here that the sequence starts (necessarily) with a =1= on the left (after the =0b= prefix). This implies that if we want to represent our spike train realizations with (unsigned) integers we must keep track of our sequence lengths in order to add extra =0= on the left side if necessary..  

*** Finding if there was a spike 5 steps ago
If we want to know if there was a spike 5 steps ago, we make a right shift of 5 =bit= before making a bitwise =and= with =1=:

#+NAME: find-event-5
#+BEGIN_SRC python :exports both :session *Python*
(18961 >> 5) & 1
#+END_SRC

#+RESULTS: find-event-5
: 0


If we try 9 steps ago we get:

#+NAME: find-event-9
#+BEGIN_SRC python :exports both :session *Python*
(18961 >> 9) & 1
#+END_SRC

#+RESULTS: find-event-9
: 1


